{
  "name": "Elon Musk",
  "summary": "Elon Musk (born June 28,1971) is an entrepreneur and a co-founder of PayPal, Tesla Motors and Space Exploration Technologies. He is chairman/CEO of Tesla Motors and SpaceX, and chairman of SolarCity. Musk was born and grew up in South Africa, the son of a South African engineer and a Canadian-born mother who has worked as a New York City dietitian and modeled for fun. His father inspired his love of technology and Musk bought his first computer at age 10 and taught himself how to program; by the age of 12 he sold his first commercial software, a space game called Blaster. He emigrated to Canada in June 1989 at age 17. He left Canada in 1992 after getting a scholarship to study business and physics at the University of Pennsylvania. He earned an undergraduate degree in economics and stayed on another year to finish a second bachelor's degree in physics.  Musk then considered three areas he wanted to get into that were \"important problems,\" as he said later. \"One was the Internet, one was clean energy, and one was space.\" In 1995, Musk moved to California to enroll in a graduate program in high energy physics at Stanford, in which he stayed exactly two days before dropping out to start Zip2, which provided online content publishing software for news organizations. In 1999, Compaq's AltaVista division acquired Zip2 for US$307 million in cash and US$34 million in stock options. In March 2002, Musk co-founded X.com, a financial services and email payments company. One year later, X.com acquired Confinity, originally a company formed to beam money between Palm Pilots, and the combined entity focused on email payments through the PayPal domain, acquired as part of Confinity. In February 2001, X.com changed its legal name to PayPal. In October 2002, PayPal was acquired by [eBay](/company/ebay) for US$1.5 billion in stock. Before its sale, Musk, the company's largest shareholder, owned 11.7% of PayPal's shares. In June 2002, Musk founded his third company, Space Exploration Technologies (SpaceX), of which he is currently the CEO and CTO. SpaceX develops rockets and spacecrafts for missions to Earth orbit and beyond. Musk served as chief engineer for Falcon 1, the first privately developed liquid-fueled rocket to reach orbit, as well as falcon 9 and the Dragon spacecraft. In 2008 SpaceX won a NASA contract to replace the cargo transport function of the space shuttle with Falcon 9 and Dragon. NASA decided in 2010 to also entrust the commercial sector with astronaut transport. In addition to his business activities in entrepreneurial space, Musk is the principal owner and Chairman of the Board of Tesla Motors, which builds a high-end luxury electric vehicle. He is also the primary investor and Chairman of the Board of SolarCity, a photovoltaics products and services startup company. The underlying motivation for funding both companies is to help combat global warming.",
  "city": "Los Angeles",
  "company": ["Tesla Motors", "Space Exploration Technologies"],
  "role": ["Chairman, CEO and Product Architect", "CEO and Chief Designer"],
  "twitter": "elonmusk"
}