{
  "name": "Goldman Sachs",
  "summary": "The Goldman Sachs Group, Inc. provides investment banking, securities, and investment management services, as well as financial services to corporations, financial institutions, governments, and high-net-worth individuals worldwide. Its Investment Banking segment offers financial advisory services, including advisory assignments with respect to mergers and acquisitions, divestitures, corporate defense, risk management, and restructurings and spin-offs; and underwriting services comprising public offerings and private placements of a range of securities, loans and other financial instruments, and derivative transactions. The company?s Institutional Client Services segment provides client execution services, such as fixed income, currency, and commodities client execution related to making markets in interest rate products, credit products, mortgages, currencies, and commodities; and equities related to making markets in equity products, as well as executes and clears institutional client transactions on stock, options, and futures exchanges. This segment also engages in securities services business providing financing, securities lending, and other brokerage services to institutional clients, including hedge funds, mutual funds, pension funds, and foundations. Its Investing and Lending segment originates longer-term loans; and invests in debt securities, loans, public and private equity securities, real estate, consolidated investment entities, distressed assets, currencies, commodities, and power generation facilities. The company?s Investment Management segment provides investment products and services, as well as offers wealth advisory services, including portfolio management and financial counseling, and brokerage and other transaction services. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.",
  "city": "New York",
  "companies": ["Tesla Motors"],
  "twitter": "goldmansachs",
  "website": "http://www.gs.com"
}
